---
kind: other
id: Methods.T:Autodesk.Revit.DB.FillPattern
source: html/bae7c642-0567-f2e7-c75a-cd0c3945b9e0.htm
---
# FillPattern Methods

Corrects pattern dots to make them be drawn properly for Revit.